package ru.itmo.lesson07_08;

import ru.itmo.lesson07_08.transport.Bus;
import ru.itmo.lesson07_08.transport.Car;
import ru.itmo.lesson07_08.transport.Train;

public class Main {
    public static void main(String[] args) {
    Car car01 = new Car(79,12345,"Red");
    Car car02 = new Car(9,345,"Green");

    Train train01 = new Train(34,567,15);
    Train train02 = new Train(34,6789,15);

    Bus bus01 = new Bus(45,78,"Orange",false);
    Bus bus02 = new Bus(9,67,"White",false);

    RepairShop repairShop01 = new RepairShop();

        repairShop01.addVehicles(car01);
        repairShop01.addVehicles(car02);
        repairShop01.addVehicles(train01);
        repairShop01.addVehicles(train02);
        repairShop01.addVehicles(bus01);
        repairShop01.addVehicles(bus02);

        repairShop01.transportRepair();

    }
}


/*
Каждое транспортное средство (поезд, автобус, легковой автомобиль) обладает следующими свойствами:

уровень износа (изначально 0);
номер (обязательное свойство, значение которого нельзя изменить);
цвет (все поезда должны быть одинакового цвета. Цвета автобусов могут быть разными,
цвета автомобилей могут быть разными. Но изменить цвет можно только у автомобиля.
Остальные транспортные средства перекрасить нельзя).

У автобуса должен быть флаг - наличие wifi.

Поезд должен хранить информацию о количестве вагонов (поезд не может быть создан без вагонов).

У автомобиля должна быть возможность изменить цвет.

Поезд, автобус и автомобиль можно отремонтировать:

у автобуса снижается уровень износа (значение не может стать меньше 0) и добавляется wifi, если его нет;
у поезда снижается уровень износа (значение не может стать меньше 0) и может быть добавлен вагон;
у автомобиля снижается уровень износа (значение не может стать меньше 0).

"Ремонтная мастерская" (отдельный класс) хранит следующую информацию:

массив транспортных средств (одновременно в мастерской может находиться до 10 транспортных средств);
массив строк - названия цветов.
Методы класса "ремонтная мастерская":

добавить транспортное средство в массив;

ремонтировать транспортные средства - все транспортные средства, находящиеся в массиве ремонтируют + автомобили перекрашивают (случайный цвет выбирать из массива с названиями цветов). После ремонта все элементы массива с транспортными средствами заменяются дефолтными значениями.

Предусмотреть возможность появления в программе типов данных, которые не будут являться автомобилями, но смогут изменять цвет в мастерской.

Все свойства должны быть объявлены с модификатором private. Необходимость проверок, геттеров и сеттеров, конструкторов, создания родительских классов и интерфейсов определить самостоятельно.
 */