package lesson02;

public class Main {
    public static void main(String[] args) {

        int first = 100;
        int second = 100;

        if (first == second) {
            System.out.println("Числа равны.Вывожу в консоль первое число и оно равно: " + first);
        } else {
            int result = first > second ? first : second;
            System.out.println("Наибольшее число равно: " + result);
        }

        //   ------------------------------------------------------------------------------------- //


        int num = 1001;


        int result = num % 2 == 0 ? 0 : -1;
        System.out.println("Если число чётное, вы увидите 0, если нет -1. Результат равен:  " + result);

        //   ------------------------------------------------------------------------------------- //

        int monthNum = 9;

        if (monthNum > 0 && monthNum < 3 || monthNum == 12) {
            System.out.println("Сейчас на дворе зима. Одевайтесь теплее и смотрите под ноги :)");
        } else if (monthNum > 2 && monthNum < 6) {
            System.out.println("Сейчас на дворе весна. День длиннее, погода лучше. Наслаждайтесь. Так будет не всегда :)");
        } else if (monthNum > 5 && monthNum < 9) {
            System.out.println("Сейчас на дворе лето. Пора загорать и купаться :)");
        } else if (monthNum > 8 && monthNum < 12) {
            System.out.println("Сейчас на дворе осень. Всё было в старь, всё повториться вновь и счастья нам лишь узнаванья миг");
        } else {
            System.out.println("Вы ввели не верный номер месяца. В году всего 12 месяцев. Введите число от 1 до 12");
        }

        //   ------------------------------------------------------------------------------------- //

        int count = 999;

        if (count > 89 && count < 101) {
            System.out.println("Оценка отлично");
        } else if (count > 59 && count < 90) {
            System.out.println("Оценка хорошо");
        } else if (count > 39 && count < 60) {
            System.out.println("Оценка удовлетворительно");
        } else if (count > 0 && count < 39) {
            System.out.println("попробуйте в следующий раз");
        } else {
            System.out.println("Вы ввели не верное значение. Введите число от 1 до 100");
        }

//   ------------------------------------------------------------------------------------- //
        int minBorder = 10;
        int maxBorder = 500;

        int randomNum = minBorder + (int) (Math.random() * ((maxBorder - minBorder) + 1));


        if (randomNum > 24 && randomNum < 201) {
            System.out.println("Случайное число в диапозоне (25,200)" + "Число равно: " + randomNum);
        } else {
            System.out.println("Случайное число за пределами диапозона (25,200)" + "Число равно: " + randomNum);
        }

//        ------------------------------------------------------------------------------------------

        double sum = 100_000;
        int saleCode = 9011;

        switch (saleCode) {
            case 4525:
                sum = sum * 0.7;
                System.out.println("сумма покупки равна: = " + sum);
                break;
            case 6424, 7012 :
                sum = sum * 0.8;
                System.out.println("сумма покупки равна: = " + sum);
                break;
            case 7647,9011,6612:
                sum = sum * 0.9;
                System.out.println("сумма покупки равна: = " + sum);
                break;
            default:
                System.out.println("Скидка не предусмотрена");


        }
    }
}


/*
Задача на тернарный оператор
Даны два целых числа. Выведите в консоль наибольшее из них. Если числа равны, выведите в консоль любое.

Задача на тернарный оператор
Дано целое число. Если оно чётное, выведите в консоль 0, если нет, то выведите в консоль -1;

Задача на IF
Дан номер месяца, например int month = 5. В зависимости от данного значения вывести в консоль время года

Задача на IF
Дана целочисленная переменная count - количество верных ответов.
В зависимости от значения этой переменной вывести в консоль оценку:
100 - 90 правильных ответов - отлично 89 - 60 правильных ответов - хорошо 59 - 40 правильных ответов -
удовлетворительно 39 - 0 правильных ответов - попробуйте в следующий раз

Задача на Math.random() и IF
Самостоятельно разобрать как работает Math.random() и написать код, который будет проверять попало ли случайно сгенерированное целое число из отрезка [10;500] в интервал (25;200) и выводить результат в консоль.

[10;500] - квадратные скобки означают, что числа включены в диапазон. (25;200) - круглые скобки означают, что числа не включены в диапазон

Примеры работы программы:

Число 345 не содержится в интервале (25;200)
Число 110 содержится в интервале (25;200)
Задача на SWITCH (ДЕЛАЙТЕ, ЕСЛИ РАЗБЕРЕТСЬ САМОСТОЯТЕЛЬНО ПО PDF ФАЙЛУ)
Дана переменная sum - сумма покупки и переменна saleCode - номер купона.

Если номер купона равен 4525 - вывести сумму с учетом скидки 30%
Если номер купона равен 6424 или 7012 - вывести сумму с учетом скидки 20%
Если номер купона равен 7647 или 9011 или 6612 - вывести сумму с учетом скидки 10%
В остальных случаях скидка не предусмотрена, вывесть полную стоимость покупки.
 */