package lesson05;

import java.util.Arrays;

public class StringTask02 {
    public static void main(String[] args) {
        String str = "JAVA стоит первым в рейтинге популярности использования языков; " +
                "JAVA один из наиболее мощных высокоуровневых языков программирования; " +
                "JAVA поддерживает большое количество встроенных библиотех,которые позволяют быстро писать " +
                "проекты любого класса сложности;\n" +
                "курс «JUNIOR JAVA DEVELOPER» предназначен для подготовки программистов-профессионалов,\n" +
                "специализирующихся на разработке программного обеспечения различного класса и уровня\n" +
                "сложности. ";


        int count = 0;
        String[] strArr = str.split(" ");
        System.out.println(Arrays.toString(strArr));
         for (int i = 0; i < strArr.length - 1; i++) {
            if (strArr[i].contains("JAVA")) {
                count++;
                strArr[i] = "PYTHON";
            }
         }
        System.out.println(" Количество повторений слова JAVA  = " + count);
        System.out.println(Arrays.toString(strArr));
    }


}


/*

Task № 2  Дан текст: JAVA стоит первым в рейтинге популярности использования языков;
JAVA один из наиболее мощных высокоуровневых языков программирования;
JAVA поддерживает большое количество встроенных библиотех,
которые позволяют быстро писать проекты любого класса сложности;
курс «JUNIOR JAVA DEVELOPER» предназначен для подготовки программистов-профессионалов,
специализирующихся на разработке программного обеспечения различного класса и уровня
сложности. Все слова "JAVA" в данном тексте заменить на "PYTHON".

Task № 3  Вывести в консоль количество слов "JAVA", встречающихся в тексте из предыдущего задания
 */